In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
# 필요모듈 import

import numpy as np
import pandas as pd

In [19]:
# pandas read_csv 메소드 호출 후 train.csv 파일 읽어옴. dataframe 형태로 반환
train = pd.read_csv('/content/drive/MyDrive/train.csv')

In [20]:
# 컬럼별 결측치 개수 확인 ( 0 ⟶ 결측치 없음 )
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
# pd의 head(n) 메소드 이용하여 n개의 레코드 출력
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
# describe 메소드를 사용/ 레코드 총 개수, 평균, 최소값, 최대값 등을 출력
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [23]:
# dtypes 메소드를 사용하여 컬럼 별 데이터 타입 확인
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [24]:
# unique 메소드를 사용하여 Series에 어떤 단일값들이 있는지 확인
train.Cabin.unique()
train.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [25]:
#  Survival컬럼 값 합 = 생존자의 수/ 전체 레코드 수 - survival = 사망한 사람 수
survival = train.Survived.sum()
n_survival = train.shape[0] - survival

In [26]:
# value_count()메소드를 사용, 승객의 지위(Pclass)별 분포 확인
train['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [27]:
# value_count()메소드 사용, 성별 탑승객 분포 확인
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [28]:
# fillna() 결측치 값 's'로 바꿈
train['Embarked'] = train['Embarked'].fillna('s')

In [30]:
# median()메소드로 'Age'필드의 중간값 가져온 후 'Age'필드의 중간값으로 'Age'필드의 결측치 채우기
train['Age'] = train['Age'].fillna(train['Age'].median())

In [32]:
# extract()메소드에 인자값으로 정규식을 전달해주면 해당 문자열 추출
train['Title'] = train['Name'].str.extract('([A-Za-z]+)\.', expand=False)

In [33]:
# replace()메소드 사용하여 첫번째 인자 해당하는 문자열 두번째 문자열로 치환
train['Title'] = train['Title'].replace(['Capt', 'col','major','Dr','Rev'], 'officer')
train['Title'] = train['Title'].replace(['Jonkheer','Master'],'Master')
train['Title'] = train['Title'].replace(['Don','Sir','the countess','Lady','Dona'],'Royalty')
train['Title'] = train['Title'].replace(['Mme','Ms','Mrs'],'Mrs')
train['Title'] = train['Title'].replace(['Mlle','Miss'],'Miss')
train['Title'] = train['Title'].replace(['Mr'],'Mr')

In [34]:
# 변수 y에 Survived 컬럼 할당
y = train.Survived

In [35]:
bin = [0, 18, 25, 35, 60, 100]
group_names = ['Baby', 'Youth', 'YoungAdult', 'MiddleAged','Sneior']
train['AgeGroup'] = pd.cut(train['Age'], bins = bin, labels = group_names)
train['AgeGroup'].value_counts()

YoungAdult    373
MiddleAged    195
Youth         162
Baby          139
Sneior         22
Name: AgeGroup, dtype: int64